#Generated by Fabric Compiler ( version 2022.2-SP6.4 <build 146967> ) at Thu May  8 15:03:32 2025

add_design "E:/JiChuang_2025/PDS_Project/axi_udp_ddr/LAB/pwm/rtl/pwm.v"
add_constraint "E:/JiChuang_2025/PDS_Project/axi_udp_ddr/LAB/pwm/rtl/IO.fdc"
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module pwm
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module pwm
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
