#Generated by Fabric Compiler ( version 2022.2-SP6.4 <build 146967> ) at Mon May 19 13:24:38 2025

add_design "E:/JiChuang_2025/PDS_Project/axi_udp_ddr/LAB/13_frequency_meter/rtl/bcd2ascii.v"
add_design "E:/JiChuang_2025/PDS_Project/axi_udp_ddr/LAB/13_frequency_meter/rtl/bin2bcd.v"
add_design "E:/JiChuang_2025/PDS_Project/axi_udp_ddr/LAB/13_frequency_meter/rtl/cymometer.v"
add_design "E:/JiChuang_2025/PDS_Project/axi_udp_ddr/LAB/13_frequency_meter/rtl/frequency_meter.v"
add_design "E:/JiChuang_2025/PDS_Project/axi_udp_ddr/LAB/13_frequency_meter/rtl/led_display_driver.v"
add_design "E:/JiChuang_2025/PDS_Project/axi_udp_ddr/LAB/13_frequency_meter/rtl/pulse_gen.v"
add_design "E:/JiChuang_2025/PDS_Project/axi_udp_ddr/LAB/13_frequency_meter/rtl/led_display_selector.v"
add_design E:/JiChuang_2025/PDS_Project/axi_udp_ddr/LAB/13_frequency_meter/prj/frequency_meter/ipcore/PLL/PLL.idf
add_constraint "E:/JiChuang_2025/PDS_Project/axi_udp_ddr/LAB/13_frequency_meter/rtl/IO.fdc"
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module frequency_meter
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module frequency_meter
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module frequency_meter
synthesize -ads -selected_syn_tool_opt 2 
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
