#Generated by Fabric Compiler ( version 2022.2 <build 117120> ) at Tue Apr  4 15:02:41 2023

add_design "C:/Users/Administrator/Desktop/FPGA_pds_prj/10_key_filter/rtl/key_filter.v"
add_simulation "C:/Users/Administrator/Desktop/FPGA_pds_prj/10_key_filter/sim/tb_key_filter.v"
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module key_filter
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos -device PGL22G -speedgrade -6 -package MBG324
compile -top_module key_filter
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module key_filter
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_design -verilog "E:/JiChuang_2025/PDS_Project/axi_udp_ddr/pangu_-remote_-lab/examination/02_key/rtl/key_filter.v"
remove_simulation "E:/JiChuang_2025/PDS_Project/axi_udp_ddr/pangu_-remote_-lab/examination/02_key/sim/tb_key_filter.v"
add_design "E:/JiChuang_2025/PDS_Project/axi_udp_ddr/pangu_-remote_-lab/examination/02_key/rtl/btn_ggle.v"
add_constraint "E:/JiChuang_2025/PDS_Project/axi_udp_ddr/pangu_-remote_-lab/examination/02_key/rtl/IO.fdc"
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module btn_ggle
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
add_simulation "E:/JiChuang_2025/PDS_Project/axi_udp_ddr/pangu_-remote_-lab/examination/02_key/sim/btn_ggle_tb.v"
