#Generated by Fabric Compiler ( version 2022.2-SP6.4 <build 146967> ) at Thu May 15 16:41:17 2025

add_design E:/JiChuang_2025/PDS_Project/axi_udp_ddr/LAB/sfp/prj/hssttest/ipcore/hsst/hsst.idf
add_design "E:/JiChuang_2025/PDS_Project/axi_udp_ddr/LAB/sfp/rtl/hsst_top.v"
add_design "E:/JiChuang_2025/PDS_Project/axi_udp_ddr/LAB/sfp/rtl/Word_Alignment_32bit.v"
add_constraint "E:/JiChuang_2025/PDS_Project/axi_udp_ddr/LAB/sfp/rtl/IO.fdc"
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
add_fic "E:/JiChuang_2025/PDS_Project/axi_udp_ddr/pangu_-remote_-lab/examination/12_sfp/prj/hssttest/synthesize/hsst_top_syn.fic"
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -top_module hsst_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
