#Generated by Fabric Compiler ( version 2022.2-SP6.4 <build 146967> ) at Thu Aug 14 13:09:26 2025

add_design "E:/JiChuang_2025/PDS_Project/axi_udp_ddr/pangu_-remote_-lab/examination/11_password_lock/rtl/led_display_driver.v"
add_design "E:/JiChuang_2025/PDS_Project/axi_udp_ddr/pangu_-remote_-lab/examination/11_password_lock/rtl/led_display_selector.v"
add_design "E:/JiChuang_2025/PDS_Project/axi_udp_ddr/pangu_-remote_-lab/examination/11_password_lock/rtl/matrix_key.v"
add_design "E:/JiChuang_2025/PDS_Project/axi_udp_ddr/pangu_-remote_-lab/examination/11_password_lock/rtl/matrix_key_trigger.v"
add_design "E:/JiChuang_2025/PDS_Project/axi_udp_ddr/pangu_-remote_-lab/examination/11_password_lock/rtl/password_lock.v"
add_design "E:/JiChuang_2025/PDS_Project/axi_udp_ddr/pangu_-remote_-lab/examination/11_password_lock/rtl/password_lock_top.v"
add_constraint "E:/JiChuang_2025/PDS_Project/axi_udp_ddr/pangu_-remote_-lab/examination/11_password_lock/rtl/IO_YH.fdc"
remove_design -verilog "E:/JiChuang_2025/PDS_Project/axi_udp_ddr/pangu_-remote_-lab/examination/11_password_lock/rtl/led_display_driver.v"
remove_design -verilog "E:/JiChuang_2025/PDS_Project/axi_udp_ddr/pangu_-remote_-lab/examination/11_password_lock/rtl/led_display_selector.v"
add_design "E:/JiChuang_2025/PDS_Project/axi_udp_ddr/pangu_-remote_-lab/led_display/new/for_lab_v2/hc595_ctrl.v"
add_design "E:/JiChuang_2025/PDS_Project/axi_udp_ddr/pangu_-remote_-lab/led_display/new/for_lab_v2/led_display_seg_ctrl.v"
remove_constraint  -logic -fdc "E:/JiChuang_2025/PDS_Project/axi_udp_ddr/pangu_-remote_-lab/examination/11_password_lock/rtl/IO_YH.fdc"
add_constraint "E:/JiChuang_2025/PDS_Project/axi_udp_ddr/Mkey_test/IO.fdc"
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -system_verilog -top_module password_lock_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -system_verilog -top_module password_lock_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -system_verilog -top_module password_lock_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
synthesize -ads -selected_syn_tool_opt 2 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -system_verilog -top_module password_lock_top
synthesize -ads -selected_syn_tool_opt 2 
add_fic "E:/JiChuang_2025/PDS_Project/axi_udp_ddr/Mkey_test/test1/synthesize/password_lock_top_syn.fic"
dev_map 
pnr 
report_timing 
gen_bit_stream 
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -system_verilog -top_module password_lock_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
remove_design -verilog "E:/JiChuang_2025/PDS_Project/axi_udp_ddr/pangu_-remote_-lab/examination/11_password_lock/pangu_-remote_-lab/examination/11_password_lock/rtl/matrix_key.v"
remove_design -verilog "E:/JiChuang_2025/PDS_Project/axi_udp_ddr/pangu_-remote_-lab/examination/11_password_lock/pangu_-remote_-lab/examination/11_password_lock/rtl/matrix_key_trigger.v"
remove_design -verilog "E:/JiChuang_2025/PDS_Project/axi_udp_ddr/pangu_-remote_-lab/examination/11_password_lock/pangu_-remote_-lab/examination/11_password_lock/rtl/password_lock.v"
remove_design -verilog "E:/JiChuang_2025/PDS_Project/axi_udp_ddr/pangu_-remote_-lab/examination/11_password_lock/pangu_-remote_-lab/examination/11_password_lock/rtl/password_lock_top.v"
remove_design -verilog "E:/JiChuang_2025/PDS_Project/axi_udp_ddr/pangu_-remote_-lab/examination/11_password_lock/pangu_-remote_-lab/led_display/new/for_lab_v2/hc595_ctrl.v"
remove_design -verilog "E:/JiChuang_2025/PDS_Project/axi_udp_ddr/pangu_-remote_-lab/examination/11_password_lock/pangu_-remote_-lab/led_display/new/for_lab_v2/led_display_seg_ctrl.v"
remove_constraint  -logic -fdc "E:/JiChuang_2025/PDS_Project/axi_udp_ddr/pangu_-remote_-lab/examination/11_password_lock/prj/IO.fdc"
add_design "E:/JiChuang_2025/PDS_Project/axi_udp_ddr/pangu_-remote_-lab/examination/11_password_lock/rtl/hc595_ctrl.v"
add_design "E:/JiChuang_2025/PDS_Project/axi_udp_ddr/pangu_-remote_-lab/examination/11_password_lock/rtl/led_display_seg_ctrl.v"
add_design "E:/JiChuang_2025/PDS_Project/axi_udp_ddr/pangu_-remote_-lab/examination/11_password_lock/rtl/matrix_key.v"
add_design "E:/JiChuang_2025/PDS_Project/axi_udp_ddr/pangu_-remote_-lab/examination/11_password_lock/rtl/matrix_key_trigger.v"
add_design "E:/JiChuang_2025/PDS_Project/axi_udp_ddr/pangu_-remote_-lab/examination/11_password_lock/rtl/password_lock.v"
add_design "E:/JiChuang_2025/PDS_Project/axi_udp_ddr/pangu_-remote_-lab/examination/11_password_lock/rtl/password_lock_top.v"
add_constraint "E:/JiChuang_2025/PDS_Project/axi_udp_ddr/pangu_-remote_-lab/examination/11_password_lock/rtl/IO.fdc"
remove_fic "E:/JiChuang_2025/PDS_Project/axi_udp_ddr/pangu_-remote_-lab/examination/11_password_lock/prj/password_lock/synthesize/password_lock_top_syn.fic"
set_arch -family Logos2 -device PG2L100H -speedgrade -6 -package FBG676
compile -system_verilog -top_module password_lock_top
synthesize -ads -selected_syn_tool_opt 2 
dev_map 
pnr 
report_timing 
gen_bit_stream 
